{
  "general": {
    "view_messages": "{count, plural, =1 {Nachricht anzeigen} other {# Nachrichten anzeigen}}",
    "hide_messages": "{count, plural, =1 {Nachricht verbergen} other {Nachrichten verbergen}}"
  },
  "Home": {
    "introduction": {
      "01": "Hey! Ich bin Yi.",
      "02": "Ich bin ein <nav>Software-Ingenieur</nav>. Ich liebe es, Dinge fürs Web zu bauen. 💻",
      "03": "Und ich bin ein <nav>Fotografie</nav> Enthusiast. 📸 Arbeite gerade an meinem eigenen Stil.",
      "04": "Neugierig?",
      "05": "Meine Website ist noch in Arbeit, die Richtung ist noch nicht ganz klar.",
      "06": "Klick dich durch, um meine Fotos anzuschauen und zu sehen, was ich mache!"
    }
  },
  "Photography": {
    "title": "Fotografie",
    "introduction": {
      "01": "📸 Willkommen in meinem Fotobereich! Für den Anfang habe ich zwei Kollektionen vorbereitet: die beeindruckende Bergstadt Chongqing und eine Auswahl an Reisefotos aus ganz Europa.",
      "02": "Ich freue mich darauf, bald mehr zu teilen, aber schau dir bis dahin diese an! Seit 2022 mache ich leidenschaftlich gerne Fotos... <more>Weiterlesen</more>"
    },
    "body": {
      "01": "Ich liebe es, Menschen und ihre Interaktionen mit ihrer Umgebung festzuhalten. Was ist ein Ort ohne seine Menschen? 📸",
      "02": "Ich mag 'unordentliche' Aufnahmen oder wie Profis sagen 'das Bildfeld verschmutzen'. Aufnahmen, die eine ganze Geschichte in einem einzigen Bild erzählen, sind meine Favoriten.",
      "03": "Ich war sehr wählerisch damit - zu wählerisch, eigentlich. Ich arbeite daran, einfach mehr Fotos zu machen und verschiedene Dinge auszuprobieren. Man weiß nie, welche einen später inspirieren! ✨",
      "04": "Meine Hauptkameras sind die Sony A7IV und das iPhone 15 Pro Max. 📷📱",
      "05": "Ich habe zwei Objektive: ein 85mm Teleobjektiv und ein 20mm Weitwinkelobjektiv.",
      "06": "Ich bearbeite alle meine Fotos in Lightroom und mache den Feinschliff in Photoshop, indem ich etwas Unschärfe und Hallation hinzufüge. Ich konzentriere mich auf Farbe und Grading und halte die Szenen so genau wie möglich - kein AI und selten lokale Bearbeitungen. 🎨"
    },
    "Collection": {
      "chongqing": {
        "title": "Chong Qing",
        "description": {
          "01": "Chong Qing, Bergstadt, Cyberpunk-Utopie, Kriegszeit-Hauptstadt, hat meine Neugier geweckt durch seine Mischung aus Tradition und futuristischen Elementen.",
          "02": "2023 habe ich Chongqing endlich von meiner Bucket-List gestrichen. Als Liebhaber von Nudeln und den betäubenden Gewürzen klang es wie ein Paradies für mich.",
          "03": "Mit den dramatischen Kontrasten und der gestuften Berglandschaft der Stadt ist es auch ein Traum für Fotografen.",
          "04": "Die hoch aufragenden Strukturen und Uferansichten erinnerten mich stark an Hongkong, aber alles war viel größer und heller, weniger kosmopolitisch, aber mit einem mutigeren, indigeneren Gefühl.",
          "05": "Ich habe oft 'Chungking', die ältere Romanisierung von Chong Qing, im Zusammenhang mit Hongkong gesehen und mich gefragt, was die Verbindung zwischen diesen beiden Städten ist.",
          "06": "Es stellt sich heraus, dass Chungking Mansions, ein historischer Knotenpunkt in Hongkong, eine Verbindung zu Chong Qings Geschichte als Kriegszeit-Hauptstadt hat. Der Name stammt anscheinend von dem Zustrom von Menschen, die sich während und nach der japanischen Invasion in diesem Gebiet sammelten. Dieses ikonische Gebäude wurde dann in Wong Kar Wais berühmtem 'Chungking Express' verewigt."
        },
        "Item": {
          "chongqing-01": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-02": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-03": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-04": {
            "title": "Chong Qing",
            "description": ""
          },
          "chongqing-05": {
            "title": "18 Stairs",
            "description": ""
          },
          "chongqing-06": {
            "title": "Chong Qing",
            "description": ""
          },
          "chongqing-07": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-08": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-09": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-10": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-11": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-12": {
            "title": "Luo Han Tempel",
            "description": ""
          }
        }
      },
      "europe": {
        "title": "Europa",
        "description": {
          "01": "Durch Europa zu reisen fühlt sich immer vertraut an, aber dennoch frisch mit so vielen neuen Orten, die es zu entdecken gilt.",
          "02": "Alte Orte erneut zu besuchen oder neue zum ersten Mal zu sehen, ist noch spannender mit einer Kamera in der Hand, die die Szenen so festhält, wie ich sie mir vorstelle. Schau dir einige meiner Lieblingsfotos an!"
        },
        "Item": {
          "alberobello-01": {
            "title": "Alberobello",
            "description": ""
          },
          "barcelona-01": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "barcelona-02": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "barcelona-03": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "bari-01": {
            "title": "Bari",
            "description": ""
          },
          "chiemsee-01": {
            "title": "Chiemsee",
            "description": ""
          },
          "london-01": {
            "title": "London",
            "description": ""
          },
          "london-02": {
            "title": "London",
            "description": ""
          },
          "munich-01": {
            "title": "München",
            "description": ""
          },
          "munich-02": {
            "title": "Oktoberfest",
            "description": ""
          },
          "rome-01": {
            "title": "Vatikan",
            "description": ""
          },
          "rome-02": {
            "title": "Ponte Cestio",
            "description": ""
          },
          "sevilla-01": {
            "title": "Plaza de España",
            "description": ""
          },
          "sevilla-02": {
            "title": "Plaza de España",
            "description": ""
          },
          "toledo-01": {
            "title": "Santa Iglesia",
            "description": ""
          },
          "toledo-02": {
            "title": "Santa Iglesia",
            "description": ""
          },
          "toledo-03": {
            "title": "Santa Iglesia",
            "description": ""
          }
        }
      }
    }
  },
  "Engineering": {
    "messages": {
      "intro": {
        "01": "👋 Hey! Willkommen in meinem kleinen Raum für alles rund ums Web und Technik. 🏡",
        "02": "Es ist noch in Arbeit, aber ich kümmere mich um alles von Inhalt bis Design und Implementierung. 💻",
        "03": "Neugierig, was, warum und wie ich Dinge tue? Tauche in die Threads unten ein und lies weiter! 👇"
      },
      "current": {
        "01": "Im Moment konzentriere ich mich auf den Fotobereich und verwandle ihn in meine persönliche Social-Media-App. 📷",
        "02": "Für den Technikbereich möchte ich es als Blog einfach halten. 📝",
        "03": "Aber schau später wieder vorbei - vielleicht wird dieses Chatfenster zu einem voll funktionsfähigen!",
        "04": "🔍 Warum ich das alles mache?",
        "05": "Ich liebe es, Dinge zu erschaffen und sie selbst zu machen, besonders wenn sie anderen Nutzen bringen können. 🌟",
        "06": "Ich bin fasziniert davon, wie verschiedene Kulturen Technologie angehen, also bleib dran für mehr darüber! 🌍"
      },
      "background": {
        "01": "Ich habe Medieninformatik studiert - ein Informatik-Studiengang mit Fokus auf Projektarbeit. 🎓",
        "02": "Wir haben alles gemacht, von Anforderungsanalyse über Prototyping, Design, Entwicklung, Forschung und Analyse.",
        "03": "Es war anspruchsvoll, aber ich habe es geliebt, alles zu lernen.",
        "04": "Meine Schwerpunkte waren Multimedia, Mensch-Computer-Interaktion und Technik.",
        "05": "Besonders gerne kreiere ich auffällige, sehr interaktive und ansprechende Benutzererfahrungen, die Spaß machen.",
        "06": "Für meine Abschlussarbeit habe ich ein Spiel entwickelt, das Augen-Tracking und Gestensteuerung nutzt. 🎮",
        "07": "Das war vor fast zehn Jahren, und jetzt haben wir Technologien wie Meta Quest und Apple Vision Pro!"
      },
      "professional": {
        "01": "Seit 2017 bin ich professioneller Websoftware-Ingenieur. 💼",
        "02": "Ich habe Erfahrung in der Entwicklung von leistungsstarken, skalierbaren Lösungen und vor allem Lösungen gesammelt, die für meine Kollegen einfach zu nutzen waren.",
        "03": "Die besten Zeiten bei der Arbeit sind, wenn ich an allem beteiligt bin, um wirkungsvolle Lösungen zu implementieren.",
        "04": "Ich hatte großartige Beziehungen zu Mentoren und Vorgesetzten und habe immer unaufhörlich deren Wissen angezapft. 🧠",
        "05": "Ich habe mich in jeden Schritt vertieft, der notwendig ist, um Funktionen, Microservices und Apps von kleiner bis internationaler Skala zu implementieren.",
        "06": "Von Implementierung, Testing, Automatisierung und QA bis hin zu Monitoring und Analytik. 🔄",
        "07": "Ich habe mich viel auf Frontend, Web-Performance, Tools, SEO, CMS und A/B-Tests konzentriert.",
        "08": "Ich bin auch sehr daran interessiert, tiefer in Echtzeitsysteme, Zahlungen, KI und nutzerbezogene Themen einzutauchen. Alles entscheidend für die Schaffung von wirkungsvolleren und nutzerzentrierten Lösungen. 🤖"
      },
      "tools": {
        "01": "Heutzutage arbeite ich hauptsächlich mit JavaScript/TypeScript und NodeJS. 🛠️",
        "02": "Ich verwende hauptsächlich Frameworks wie React und NextJS, um dynamische, leistungsstarke Webanwendungen zu entwickeln."
      },
      "outro": {
        "01": "Gut, das war's vorerst! Ich hoffe, das gibt dir einen guten Überblick.",
        "02": "Wenn du spannende Möglichkeiten oder Herausforderungen hast, die mit meinen Fähigkeiten und Interessen übereinstimmen, würde ich gerne von dir hören. 📬",
        "03": "🤝 Lass uns vernetzen!"
      }
    }
  }
}
