{
  "general": {
    "view_messages": "view {count, plural, =1 {message} other {# messages}}",
    "hide_messages": "hide {count, plural, =1 {message} other {messages}}"
  },
  "Home": {
    "introduction": {
      "01": "Hey there! I'm Yi",
      "02": "I'm a <nav>Software Engineer</nav>. I love building things for the web. 💻",
      "03": "And I'm into <nav>photography</nav>. Currently working on my own style. 📸",
      "04": "Curious?",
      "05": "My site is a work in progress, still figuring out a direction.",
      "06": "Click through to check out my photos and see what I'm up to!"
    }
  },
  "Photography": {
    "title": "Photography",
    "introduction": {
      "01": "📸 Welcome to my photography space! I've prepared two collections for now: the stunning mountain city of Chongqing and a showcase of travel pictures from across Europe.",
      "02": "I'm excited to share more soon, but take a look at these for now! I've been avidly taking pictures since 2022... <more>Read more</more>"
    },
    "body": {
      "01": "I love capturing people and how they interact with their surroundings. What's a place without its people, after all? 📸",
      "02": "I enjoy 'messy' shots or 'dirtying the frame' as professionals call it. Shots that tell a whole story in a single frame are my favorite.",
      "03": "I've been very picky about this—too picky, actually. I'm working on just taking more shots, trying different things. You never know which ones might inspire you later! ✨",
      "04": "My main cameras are the Sony A7IV and the iPhone 15 Pro Max. 📷📱",
      "05": "I have two lenses: an 85mm telephoto and a 20mm wide-angle lens. I've mostly used the 85mm-love the depth of field, but lately, I've realized some of my favorite shots are with the 20mm.",
      "06": "I edit all my photos in Lightroom and finish in Photoshop, adding some blur and hallation. I focus on color and grading, keeping scenes as accurate as possible—no AI, and rarely any spot edits. 🎨",
      "07": "I haven't added presets to my workflow yet, so editing a new batch of photos still takes quite some time."
    },
    "Collection": {
      "chongqing": {
        "title": "Chong Qing",
        "description": {
          "01": "Chong Qing, Mountain City, Cyberpunk Utopia, Wartime Capital, captured my curiosity for its blend of tradition and futuristic elements.",
          "02": "In 2023, I finally ticked off Chongqing from my bucket list. As a lover of noodles and the numbing spices, it sounded like paradise to me.",
          "03": "With the city's dramatic contrasts and layered mountainous landscape, it's also a photographer's dream.",
          "04": "Its towering structures and waterfront views reminded me a lot of Hong Kong, but with everything way bigger and brighter, less cosmopolitan but with a bolder, more indigenous feel.",
          "05": "I've often seen 'Chungking', the older romanization of Chong Qing, in relation to Hong Kong and it got me wondering about the connection between these two cities.",
          "06": "It turns out that Chungking Mansions, a historic hub in Hong Kong, shares a connection with Chong Qing's history as a wartime capital. Its name apparently originated from the influx of people who converged in the area during and after the Japanese invasion. This iconic building would then be immortalized in Wong Kar Wai's famous 'Chungking Express'."
        },
        "Item": {
          "chongqing-01": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-02": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-03": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-04": {
            "title": "Chong Qing",
            "description": ""
          },
          "chongqing-05": {
            "title": "18 Stairs",
            "description": ""
          },
          "chongqing-06": {
            "title": "Chong Qing",
            "description": ""
          },
          "chongqing-07": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-08": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-09": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-10": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-11": {
            "title": "Luo Han Tempel",
            "description": ""
          },
          "chongqing-12": {
            "title": "Luo Han Tempel",
            "description": ""
          }
        }
      },
      "europe": {
        "title": "Europa",
        "description": {
          "01": "Traveling through Europe always feels familiar, yet fresh with so many new places to explore.",
          "02": "Revisiting old spots or seeing new ones for the first time is even more exciting with a camera in hand, capturing scenes just as I envision them. Check out some of my favorite shots!"
        },
        "Item": {
          "alberobello-01": {
            "title": "Alberobello",
            "description": ""
          },
          "barcelona-01": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "barcelona-02": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "barcelona-03": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "bari-01": {
            "title": "Bari",
            "description": ""
          },
          "chiemsee-01": {
            "title": "Chiemsee",
            "description": ""
          },
          "london-01": {
            "title": "London",
            "description": ""
          },
          "london-02": {
            "title": "London",
            "description": ""
          },
          "munich-01": {
            "title": "München",
            "description": ""
          },
          "munich-02": {
            "title": "Oktoberfest",
            "description": ""
          },
          "rome-01": {
            "title": "Vatikan",
            "description": ""
          },
          "rome-02": {
            "title": "Ponte Cestio",
            "description": ""
          },
          "sevilla-01": {
            "title": "Plaza de España",
            "description": ""
          },
          "sevilla-02": {
            "title": "Plaza de España",
            "description": ""
          },
          "toledo-01": {
            "title": "Santa Iglesia",
            "description": ""
          },
          "toledo-02": {
            "title": "Santa Iglesia",
            "description": ""
          },
          "toledo-03": {
            "title": "Santa Iglesia",
            "description": ""
          }
        }
      }
    }
  },
  "Engineering": {
    "messages": {
      "intro": {
        "01": "👋 Hey there! Welcome to my little space for all things web and engineering. 🏡",
        "02": "It's a work in progress, but I'm handling everything from content to design and implementation. 💻",
        "03": "Curious about what, why, and how I do things? Dive into the threads below and keep reading! 👇"
      },
      "current": {
        "01": "Right now, I'm focusing on the Photography space, turning it into my personal social media app. 📷",
        "02": "For the engineering section, I want to keep it simple as a blog. 📝",
        "03": "But check back later - you might find this chat window turned into a fully functional one!",
        "04": "🔍 Why I'm doing all of this?",
        "05": "I love creating things and doing them myself, especially if it can bring value to others. 🌟",
        "06": "I'm fascinated by how different cultures approach technology, so stay tuned for more on that! 🌍"
      },
      "background": {
        "01": "I studied Media Informatics - a computer science major focused on project work. 🎓",
        "02": "We did everything from requirements gathering to prototyping, designing, development, research, and analysis.",
        "03": "It was demanding, but I loved learning how to do it all.",
        "04": "My focus areas were multimedia, human-computer interaction, and engineering.",
        "05": "I particularly enjoy creating eye-catching, highly interactive and engaging user experiences that are fun to use.",
        "06": "For my thesis, I developed a game using eye-tracking and gesture controls. 🎮",
        "07": "That was almost ten years ago, and now we have tech like Meta Quest and Apple Vision Pro!"
      },
      "professional": {
        "01": "I've been a professional web software engineer since 2017. 💼",
        "02": "I've gained experience developing high-performing, scalable solutions and most importantly, solutions that were easy to work with for me peers.",
        "03": "The best times at work are when I'm involved in everything to implement impactful solutions.",
        "04": "I've had great relationships with mentors and superiors, always picking their brains non-stop. 🧠",
        "05": "I've delved into every step needed to deploy features, microservices, and apps from small to international scale.",
        "06": "From implementation, testing, automation, and QA to monitoring and analytics. 🔄",
        "07": "I've focused a lot on Frontend, Web Performance, tooling, SEO, CMS, and A/B testing.",
        "08": "I'm also very interested in diving deeper into real-time systems, payments, AI, and user-related topics. All vital for creating more impactful and user-centric solutions. 🤖"
      },
      "tools": {
        "01": "These days, most of my work is with JavaScript/TypeScript and NodeJS. 🛠️",
        "02": "I primarily use frameworks like React and NextJS to build dynamic, high-performance web applications."
      },
      "outro": {
        "01": "Alright, that's it for now! Hope this gives you a good overview.",
        "02": "If you have exciting opportunities or challenges that resonate with my skill set and interests I'd love to hear from you. 📬",
        "03": "🤝 Let's Connect!"
      }
    }
  }
}