{
  "general": {
    "view_messages": "bekijk {count, plural, =1 {bericht} other {# berichten}}",
    "hide_messages": "verberg {count, plural, =1 {bericht} other {berichten}}"
  },
  "Home": {
    "introduction": {
      "01": "Hoi! Ik ben Yi",
      "02": "Ik ben een <nav>Software Engineer</nav>. Ik houd ervan om dingen voor het web te bouwen. 💻",
      "03": "En ik ben een <nav>fotografie</nav> enthousiast. 📸 Ik werk momenteel aan mijn eigen stijl.",
      "04": "Nieuwsgierig?",
      "05": "Mijn site is nog in ontwikkeling, ik ben nog op zoek naar een richting.",
      "06": "Klik verder om mijn foto's te bekijken en te zien waar ik mee bezig ben!"
    }
  },
  "Photography": {
    "title": "Fotografie",
    "introduction": {
      "01": "📸 Welkom in mijn fotografieruimte! Voor nu heb ik twee collecties voorbereid: de verbluffende bergstad Chongqing en een showcase van reisfoto's uit heel Europa.",
      "02": "Ik ben enthousiast om binnenkort meer te delen, maar bekijk deze alvast! Sinds 2022 maak ik graag foto's... <more>Lees meer</more>"
    },
    "body": {
      "01": "Ik houd ervan om mensen en hun interactie met hun omgeving vast te leggen. Wat is een plek zonder zijn mensen, tenslotte? 📸",
      "02": "Ik geniet van 'rommelige' foto's of 'het kader vuil maken' zoals professionals het noemen. Opnames die een heel verhaal in één beeld vertellen, zijn mijn favoriet.",
      "03": "Ik ben hier erg kieskeurig over geweest - te kieskeurig, eigenlijk. Ik werk eraan om gewoon meer foto's te maken, verschillende dingen te proberen. Je weet nooit welke je later kunnen inspireren! ✨",
      "04": "Mijn belangrijkste camera's zijn de Sony A7IV en de iPhone 15 Pro Max. 📷📱",
      "05": "Ik heb twee lenzen: een 85mm telelens en een 20mm groothoeklens.",
      "06": "Ik bewerk al mijn foto's in Lightroom en maak ze af in Photoshop, waarbij ik wat blur en hallatie toevoeg. Ik focus op kleur en grading, en houd de scènes zo accuraat mogelijk - geen AI en zelden lokale bewerkingen. 🎨"
    },
    "Collection": {
      "chongqing": {
        "title": "Chong Qing",
        "description": {
          "01": "Chong Qing, Bergstad, Cyberpunk Utopia, Oorlogshoofdstad, trok mijn nieuwsgierigheid door zijn mix van traditie en futuristische elementen.",
          "02": "In 2023 heb ik eindelijk Chongqing van mijn bucketlist afgestreept. Als liefhebber van noedels en verdovende kruiden klonk het als een paradijs voor mij.",
          "03": "Met de dramatische contrasten en gelaagde berglandschap van de stad is het ook een droom voor fotografen.",
          "04": "De torenhoge structuren en uitzichten op het water deden me erg denken aan Hong Kong, maar alles is veel groter en helderder, minder kosmopolitisch, maar met een gedurfdere, meer inheemse sfeer.",
          "05": "Ik heb vaak 'Chungking', de oudere romanisering van Chong Qing, gezien in relatie tot Hong Kong en vroeg me af wat de connectie tussen deze twee steden is.",
          "06": "Het blijkt dat Chungking Mansions, een historische hub in Hong Kong, een connectie heeft met de geschiedenis van Chong Qing als oorlogshoofdstad. De naam is blijkbaar afkomstig van de toestroom van mensen die zich tijdens en na de Japanse invasie in het gebied verzamelden. Dit iconische gebouw werd vervolgens vereeuwigd in Wong Kar Wai's beroemde 'Chungking Express'."
        },
        "Item": {
          "chongqing-01": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-02": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-03": {
            "title": "Hong Ya Dong",
            "description": ""
          },
          "chongqing-04": {
            "title": "Chong Qing",
            "description": ""
          },
          "chongqing-05": {
            "title": "18 Stairs",
            "description": ""
          },
          "chongqing-06": {
            "title": "Chong Qing",
            "description": ""
          },
          "chongqing-07": {
            "title": "Luo Han Temple",
            "description": ""
          },
          "chongqing-08": {
            "title": "Luo Han Temple",
            "description": ""
          },
          "chongqing-09": {
            "title": "Luo Han Temple",
            "description": ""
          },
          "chongqing-10": {
            "title": "Luo Han Temple",
            "description": ""
          },
          "chongqing-11": {
            "title": "Luo Han Temple",
            "description": ""
          },
          "chongqing-12": {
            "title": "Luo Han Temple",
            "description": ""
          }
        }
      },
      "europe": {
        "title": "Europa",
        "description": {
          "01": "Reizen door Europa voelt altijd vertrouwd aan, maar tegelijkertijd ook fris met zoveel nieuwe plaatsen om te ontdekken.",
          "02": "Het herbezoeken van oude plekken of het voor de eerste keer zien van nieuwe plekken is nog spannender met een camera in de hand, die de scènes vastlegt zoals ik ze voor ogen heb. Bekijk enkele van mijn favoriete foto's!"
        },
        "Item": {
          "alberobello-01": {
            "title": "Alberobello",
            "description": ""
          },
          "barcelona-01": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "barcelona-02": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "barcelona-03": {
            "title": "La Sagrada Família",
            "description": ""
          },
          "bari-01": {
            "title": "Bari",
            "description": ""
          },
          "chiemsee-01": {
            "title": "Chiemsee",
            "description": ""
          },
          "london-01": {
            "title": "Londen",
            "description": ""
          },
          "london-02": {
            "title": "Londen",
            "description": ""
          },
          "munich-01": {
            "title": "München",
            "description": ""
          },
          "munich-02": {
            "title": "Oktoberfest",
            "description": ""
          },
          "rome-01": {
            "title": "Vaticaan",
            "description": ""
          },
          "rome-02": {
            "title": "Ponte Cestio",
            "description": ""
          },
          "sevilla-01": {
            "title": "Plaza de España",
            "description": ""
          },
          "sevilla-02": {
            "title": "Plaza de España",
            "description": ""
          },
          "toledo-01": {
            "title": "Santa Iglesia",
            "description": ""
          },
          "toledo-02": {
            "title": "Santa Iglesia",
            "description": ""
          },
          "toledo-03": {
            "title": "Santa Iglesia",
            "description": ""
          }
        }
      }
    }
  },
  "Engineering": {
    "messages": {
      "intro": {
        "01": "👋 Hoi! Welkom op mijn kleine plek voor alles wat met web en techniek te maken heeft. 🏡",
        "02": "Het is een work in progress, maar ik doe alles van content tot ontwerp en implementatie. 💻",
        "03": "Nieuwsgierig naar wat, waarom en hoe ik dingen doe? Duik in de threads hieronder en blijf lezen! 👇"
      },
      "current": {
        "01": "Op dit moment focus ik me op de fotografieruimte, en maak er mijn persoonlijke social media app van. 📷",
        "02": "Voor het techniekgedeelte wil ik het simpel houden als een blog. 📝",
        "03": "Maar kom later nog eens terug - je zou dit chatvenster kunnen zien veranderen in een volledig functioneel venster!",
        "04": "🔍 Waarom ik dit allemaal doe?",
        "05": "Ik houd ervan om dingen te creëren en zelf te doen, vooral als het waarde kan brengen voor anderen. 🌟",
        "06": "Ik ben gefascineerd door hoe verschillende culturen technologie benaderen, dus blijf op de hoogte voor meer hierover! 🌍"
      },
      "background": {
        "01": "Ik heb Media Informatica gestudeerd - een informatica major gericht op projectwerk. 🎓",
        "02": "We deden alles van vereisten verzamelen tot prototyping, ontwerp, ontwikkeling, onderzoek en analyse.",
        "03": "Het was veeleisend, maar ik hield ervan om te leren hoe ik alles moest doen.",
        "04": "Mijn focusgebieden waren multimedia, mens-computer interactie en techniek.",
        "05": "Ik geniet er vooral van om opvallende, zeer interactieve en boeiende gebruikerservaringen te creëren die leuk zijn om te gebruiken.",
        "06": "Voor mijn scriptie heb ik een game ontwikkeld met oogtracking en gebarenbediening. 🎮",
        "07": "Dat was bijna tien jaar geleden, en nu hebben we technologie zoals Meta Quest en Apple Vision Pro!"
      },
      "professional": {
        "01": "Sinds 2017 ben ik een professionele websoftware engineer. 💼",
        "02": "Ik heb ervaring opgedaan in het ontwikkelen van high-performing, schaalbare oplossingen en vooral oplossingen die makkelijk te gebruiken waren voor mijn collega's.",
        "03": "De beste tijden op het werk zijn wanneer ik overal bij betrokken ben om impactvolle oplossingen te implementeren.",
        "04": "Ik heb geweldige relaties gehad met mentoren en superieuren, en ik heb altijd hun hersens doorgezaagd. 🧠",
        "05": "Ik heb me verdiept in elke stap die nodig is om functies, microservices en apps van kleine tot internationale schaal te implementeren.",
        "06": "Van implementatie, testen, automatisering en QA tot monitoring en analyse. 🔄",
        "07": "Ik heb veel gefocust op frontend, web performance, tooling, SEO, CMS en A/B testen.",
        "08": "Ik ben ook zeer geïnteresseerd om dieper in te gaan op realtime systemen, betalingen, AI en gebruikersgerelateerde onderwerpen. Allemaal essentieel voor het creëren van meer impactvolle en gebruikersgerichte oplossingen. 🤖"
      },
      "tools": {
        "01": "Tegenwoordig doe ik het meeste werk met JavaScript/TypeScript en NodeJS. 🛠️",
        "02": "Ik gebruik voornamelijk frameworks zoals React en NextJS om dynamische, high-performance webapplicaties te bouwen."
      },
      "outro": {
        "01": "Goed, dat is het voorlopig! Ik hoop dat dit je een goed overzicht geeft.",
        "02": "Als je spannende kansen of uitdagingen hebt die resoneren met mijn vaardigheden en interesses, hoor ik graag van je. 📬",
        "03": "🤝 Laten we verbinden!"
      }
    }
  }
}
